{"APM":{"Transaction":{"accountId":"The unique ID of the account associated with the service/application where the Transaction was created.","appId":"The unique numeric identifier assigned by New Relic for the service/application where the transaction was created.","appName":"The application name set in the New Relic agent configuration.","databaseCallCount":"The number of database calls made by this transaction.","databaseDuration":"The database response time in seconds.","duration":"The total server-side response time for the transaction, in seconds. Does not include request queueing time.","entityGuid":"The GUID, assigned by New Relic, for the New Relic-monitored entity (host, application, etc.). This value is stored as a Base64 encoded value.","errorMessage":"(.NET and PHP agents only) This will be server and platform specific. The message contained within an error for the transaction. If an error occurs during a transaction, the error may skew the duration of the event.","errorType":"This will be server and platform specific. The class or classification of the error. If multiple errors occur, only the first will be shown. If an error occurs during a transaction, the error may skew the duration of the event.","externalCallCount":"The number of external calls made by this transaction.","externalDuration":"The total response time of all externals, in seconds.","gcCumulative":"(Ruby and Java agents only) The total time spent in garbage collection during this transaction, in seconds.","guid":"The identifier for the transaction.","host":"The name of the application host that processed this request.","httpResponseCode":"The HTTP response code associated with the transaction.","memcacheDuration":"The memcache response time, in seconds.","name":"The name of the transaction associated with this data. Ex: Controller/customers/show.","parent.account":"If a distributed tracing payload is received, this is the account identifier for the transaction's upstream caller.","parent.app":"If a distributed tracing payload is received, this is the application identifier. APM agents retrieve this value in the connect response under the key primary_application_id.","parent.transportDuration":"When distributed tracing is enabled and a payload is received, the difference in time between the timestamp given for when the payload was sent and the moment it was processed.","parent.transportType":"When a distributed tracing payload is received, the method of transport for the payload. Example values: Unknown, HTTP, HTTPS, Kafka, JMS, IronMQ, AMQP, Queue, or Other.","parent.type":"If a distributed trace payload was received, the parent's data source type. Example values: App, Browser, Mobile.","parentId":"If a distributed trace payload was received, the guid of this parent transaction.","priority":"Likelihood this event will be saved.","queueDuration":"The total time the requester waits for a service to initiate, in seconds.","realAgentId":"The ID of the New Relic agent that reported the data.","request.headers.contentLength":"Incoming request size in bytes as read from the Content-Length HTTP request header.","request.headers.contentType":"Incoming request content-type as read from the HTTP request header Content-Type. Example value: application/octet-stream.","request.headers.host":"The name from the HTTP host request header.","request.headers.referer":"The incoming request referer as read from the Referer request header.","request.headers.User-Agent":"The contents of the User-Agent HTTP header.","request.method":"The HTTP request method used. Example values: POST, GET.","requests.header.accept":"The types as read from the HTTP Accept request header.","response.headers.contentLength":"The outgoing response size in bytes as read from the Content-Length response header.","response.headers.contentType":"For an HTTP response, the data type of the returned response. Example values: text/html, application/json.","sampled":"Indicates whether this event was sampled for inclusion in a distributed trace. Only present when distributed tracing is enabled.","totalTime":"The sum of all async components' duration, in seconds. An async component is a method or function where there is no instrumented encapsulating method or function.","transactionSubType":"The detailed type of transaction. Example: Controller or Custom.","transactionType":"The type of the transaction. For example: Web or Background (non-web).","tripId":"A randomly-generated string that is consistent for every transaction in a cross-application trace. This string can be used to identify the set of transactions associated with a particular trip or trace. If distributed tracing is enabled, this will be reported as traceId.","webDuration":"The duration of the transaction, equivalent to duration."},"TransactionError":{"accountId":"The unique ID of the account associated with the service/application where the Transaction was created.","appId":"The unique numeric identifier assigned by New Relic for the service/application where the transaction was created.","appName":"The application name set in the New Relic agent configuration.","databaseCallCount":"The number of database calls made by this transaction.","databaseDuration":"The database response time in seconds.","duration":"The total server-side response time for the transaction, in seconds. Does not include request queueing time.","entityGuid":"The GUID, assigned by New Relic, for the New Relic-monitored entity (host, application, etc.). This value is stored as a Base64 encoded value.","error.class":"The class name or type for the error. This will be server and platform specific.","error.expected":"Determines whether an error is expected or not. Expected errors do not affect error rates or Apdex.","error.message":"The error message for the transaction. This will be server and platform specific.","errorType":"This will be server and platform specific. The class or classification of the error. If multiple errors occur, only the first will be shown. If an error occurs during a transaction, the error may skew the duration of the event.","externalCallCount":"The number of external calls made by this transaction.","externalDuration":"The total response time of all externals, in seconds.","gcCumulative":"(Ruby and Java agents only) The total time spent in garbage collection during this transaction, in seconds.","guid":"The identifier for the transaction.","host":"The name of the application host that processed this request.","httpResponseCode":"The HTTP response code associated with the transaction.","memcacheDuration":"The memcache response time, in seconds.","parent.account":"If a distributed tracing payload is received, this is the account identifier for the transaction's upstream caller.","parent.app":"If a distributed tracing payload is received, this is the application identifier. APM agents retrieve this value in the connect response under the key primary_application_id.","parent.transportDuration":"When distributed tracing is enabled and a payload is received, the difference in time between the timestamp given for when the payload was sent and the moment it was processed.","parent.transportType":"When a distributed tracing payload is received, the method of transport for the payload. Example values: Unknown, HTTP, HTTPS, Kafka, JMS, IronMQ, AMQP, Queue, or Other.","parent.type":"If a distributed trace payload was received, the parent's data source type. Example values: App, Browser, Mobile.","parentId":"If a distributed trace payload was received, the guid of this parent transaction.","port":"The listening port of the transaction that generated the event. This information will not always be available, so this attribute may not always be reported.","priority":"Likelihood this event will be saved.","queueDuration":"The total time the requester waits for a service to initiate, in seconds.","realAgentId":"The ID of the New Relic agent that reported the data.","request.headers.contentLength":"Incoming request size in bytes as read from the Content-Length HTTP request header.","request.headers.contentType":"Incoming request content-type as read from the HTTP request header Content-Type. Example value: application/octet-stream.","request.headers.host":"The name from the HTTP host request header.","request.headers.referer":"The incoming request referer as read from the Referer request header.","request.headers.User-Agent":"The contents of the User-Agent HTTP header.","request.method":"The HTTP request method used. Example values: POST, GET.","requests.header.accept":"The types as read from the HTTP Accept request header.","response.headers.contentLength":"The outgoing response size in bytes as read from the Content-Length response header.","response.headers.contentType":"For an HTTP response, the data type of the returned response. Example values: text/html, application/json.","sampled":"Indicates whether this event was sampled for inclusion in a distributed trace. Only present when distributed tracing is enabled.","threadConcurrency":"A measure of thread utilization, representing the number of threads handling concurrent requests.","timestamp":"The start time of the job in epoch milliseconds.","traceId":"Links all New Relic trace data (events, etc.) within the call chain together. Included when Distributed Tracing is enabled.","transactionName":"Name of the transaction in which the error occurred. Example value: Controller/customers/show. Value may be 'Unknown' if an error occurs outside of a transaction.","transactionUiName":"The UI display name equivalent of transactionName.","wsgi.input.calls.read":"(Python agent only) The number of calls to read() by the WSGI server to handle request.","wsgi.input.calls.readline":"(Python agent only) The number of calls to readline() by the WSGI server to handle request.","wsgi.input.calls.readlines":"(Python agent only) The number of calls to readlines() by the WSGI server to handle request.","wsgi.output.calls.write":"(Python agent only) Number of calls to yield by the WSGI server to send response.","wsgi.output.calls.yield":"(Python agent only) Number of calls to yield by the WSGI server to send response."}},"Account Usage":{"NrAuditEvent":{"actionIdentifier":"Indicates an action that was taken in a New Relic account.  Read more.","actorAPIKey":"ID of the API key taking action. The API key is partially obfuscated to ensure privacy of the key.","actorEmail":"Email address for the person who made the change.","actorId":"ID of the person taking action.","actorIpAddress":"The IP address for the person or API key where the action initiated.","actorType":"Identifies whether the action was initiated by a user (person) or with an API key that is not associated with a user. Read more.","description":"Human-readable description of the action taken. For example: Added name@company.com to roles Browser manager.","id":"Unique ID of the audit event.","targetId":"ID of the object (targetType) that changed. For example, if the targetType is a user, this is the person's New Relic user ID.","targetType":"The object that changed: account, role, or user.","timestamp":"Date and time the audit event occurred. Used to specify a day or range of dates.  Read more."},"NrDailyUsage":{"agentHostname":"ID reported by the agent to uniquely identify the host for which this usage event is reported.  Read more.","apmAgentMemoryBytes":"Bytes of RAM available to the host, as detected by the New Relic agent from the host OS.","apmAgentProcessorCount":"Number of logical CPU cores available to the host, as detected by the New Relic agent from the host OS.","apmAgentVersion":"Version of the New Relic APM agent running in the application instance reporting this usage.  Read more.","apmAppId":"ID uniquely identifying the application that is reporting this usage, as it appears in the APM product. Present only for events where usageType equals Application.","apmAppInstanceId":"ID uniquely identifying the application instance (the process running the New Relic APM agent).","apmAppName":"Name of the application reporting this usage, as it appears in the APM product. Present only for events where usageType equals Application.","apmBillingInstanceSize":"Size of the host, for CU-based billing purposes.  Read more.","apmCloudDerivedMemoryBytes":"Bytes of RAM available to the host, as defined by the cloud provider for the host's instance type.","apmCloudDerivedProcessorCount":"Number of logical processors available to the host, as defined by the cloud provider for the host's instance type.","apmComputeUnitRule":"Describes the algorithm used to calculate the host size for CU usage. Read more.","apmComputeUnits":"Number of compute units (CUs) recorded for the given host.  Read more.","apmContainerCount":"The number of unique container IDs associated with this host. Present only for events where usageType equals Host.","apmHoursUsed":"Number of hours for which usage was recorded for the given entity. Read more.","apmLanguage":"Name of the language that the usage-reporting application is written in, as reported by the New Relic agent.  Read more.","apmMemoryBytes":"Bytes of RAM available to th©e host. Used to calculate apmBillingInstanceSize.  Read more.","apmProcessorCount":"Number of logical processors available to the host, used to calculate apmBillingInstanceSize.  Read more.","bootId":"Linux boot ID of host for which this usage is reported, which is unique for each boot lifetime of each Linux operating system instance.  Read more.","browserAppId":"ID uniquely identifying the application reporting this usage, as it appears in the Browser product.","browserPageViewCount":"Number of page views for an application for that 24-hour period.  Read more.","cloudInstanceId":"ID uniquely identifying the cloud host instance (example: an AWS EC2 instance) for which this usage is reported. Read more.","cloudInstanceSize":"Size of the cloud instance for this host for CU-based APM billing purposes.  Read more.","cloudInstanceType":"Instance type of the host as defined by the cloud provider and detected by the agent.  Read more.","cloudProvider":"Name of the cloud provider for this host. Example values: aws, azure. This will not be present if no cloud provider was detected by the agent.","cloudZone":"Name of the zone that a cloud provider host is located in.  Read more.","consumingAccountId":"ID of the New Relic account that is directly responsible for the stored events, as determined from the license key used.","consumingAccountName":"Name of the New Relic account that is directly responsible for the stored events, as determined from the license key used.","containerId":"ID of the Docker or other Linux container in which the application instance is running.  Read more.","hostId":"ID used to uniquely identify the host for which this usage is reported.  Read more.","infrastructureAgentMemoryBytes":"Bytes of RAM available to the host, used to calculate infrastructureBillingInstanceSize.","infrastructureAgentProcessorCount":"Number of logical CPU cores available to the host, used to calculate infrastructureBillingInstanceSize.","infrastructureAgentVersion":"Version of the Infrastructure agent running on the host reporting this usage. Read more.","infrastructureBillingInstanceSize":"Size of the host, for CU billing purposes. Calculated as: number of processors multiplied by memory in gibibytes (GiB).","infrastructureCloudDerivedMemoryBytes":"Bytes of RAM available to the host, as reported by the cloud provider, used to calculate infrastructureBillingInstanceSize.","infrastructureCloudDerivedProcessorCount":"Number of logical CPU cores available to the host, as reported by the cloud provider, used to calculate infrastructureBillingInstanceSize.","infrastructureComputeUnitRule":"Describes the algorithm used to calculate the host size for CU usage.  Read more.","infrastructureComputeUnits":"Number of compute units (CUs) recorded for the given host.  Read more.","infrastructureHoursUsed":"Number of hours for which usage was recorded for the given host. When a host is connected to New Relic for any amount of time within a given hour, that hour is counted toward usage.","insightsEventNamespace":"The type of event. For example: Transaction, MobileCrash, or SystemSample. Event namespaces are associated with a specific data retention period.","insightsIncludedEventCount":"Count of all events of the given insightsEventNamespace stored for the retention period included with a paid non-Insights product subscription.  Read more.","insightsIncludedRetentionInHours":"Number of hours for which events of the given insightsEventNamespace are stored but are not counted toward your paid Insights Pro subscription. Read more.","insightsNrProduct":"New Relic product (Insights, APM, Browser, Mobile, etc.) that corresponds to the given insightsEventNamespace.","insightsTotalEventCount":"Count of all events stored for the given insightsEventNamespace as of the given day.  Read more.","insightsTotalRetentionInHours":"Number of hours for which events of the given insightsEventNamespace are stored.","instanceSizeCapped":"This is True if the calculated host size was greater than 16 and therefore capped.","isPrimaryApp":"Boolean. true means the application is the primary app. false means the app is one of several apps that an agent reports data for.  Read more.","masterAccountId":"The ID of the master account that is either responsible for stored events or that is the parent of the consuming account.  Read more.","masterAccountName":"Name of the master account that is either responsible for stored events, or that is the parent of the consuming account.  Read more.","missingCpuData":"This is True if the APM agent reports no CPU count.","missingRamData":"This is True if the APM agent reports no memory count.","mobileAppId":"ID uniquely identifying the application reporting this usage, as it appears in the Mobile product.","mobileAppName":"Name of the application reporting this usage, as it appears in the Mobile product.","mobileUniqueUsersPerMonth":"Number of unique users (device IDs) counted during the current calendar month to date for a Mobile app.","partnershipId":"Partner ID of the New Relic customer partnership associated with the account responsible for the stored events.  Read more.","partnershipName":"Name of the New Relic customer partnership associated with the account responsible for the stored events.  Read more.","productLine":"The New Relic product the usage data is from. Use this attribute to identify / filter for product specific usage data.","subAccountId":"ID of the sub-account that is responsible for the stored event. When this attribute is present, subAccountId is the consumingAccountId.  Read more.","subAccountName":"Name of the sub-account responsible for stored events. When present, this attribute is the same as the consumingAccountName.  Read more.","syntheticsFailedCheckCount":"Number of failed checks that ran on the given day for the given Synthetics monitor and location.  Read more.","syntheticsLocation":"Location the check ran in.","syntheticsLocationLabel":"Human-readable label for the location of the check. Read more.","syntheticsMonitorId":"Unique ID of the monitor.","syntheticsMonitorName":"Name of the monitor.","syntheticsSuccessCheckCount":"Number of successful checks that ran on the given day for the given Synthetics monitor and location.  Read more.","syntheticsType":"The type of Synthetics monitor. Possible values: SIMPLE, BROWSER, SCRIPT_BROWSER, SCRIPT_API.  Read more.","syntheticsTypeLabel":"Human-readable label for syntheticsType. Possible values: Ping, Simple Browser, Scripted Browser, Scripted API.","timestamp":"UNIX timestamp (seconds since epoch) of the day and time when event generation was initiated.","usageType":"For APM, this value can be either Application or Host, depending on the type of entity this event records usage for (other New Relic products will have different values for usageType). Read more."},"NrIntegrationError":{"apiKeyPrefix":"The first six characters of the Insert API key used for the request that generated an error.","category":"The category of the error. For custom events, this is EventApiException.","httpResponseCode":"The HTTP response code associated with the transaction.","message":"Contents of the error message.","name":"The error's name. For custom events, this is always EventValidationException.","newRelicFeature":"The name of the feature experiencing errors. For all custom event parsing errors, this will be Event API.","requestId":"The UUID returned by the the API for the request that generated an error.","timestamp":"The timestamp when the request was received. The timestamp attribute takes an unformatted Unix timestamp. You can define timestamps either in seconds or in milliseconds, both relative to the Unix epoch."}},"Browser":{"PageAction":{"actionName":"The name of the PageAction, as defined by you in your code.","appId":"The ID of your application, as recorded by New Relic.","appName":"The name of the application that handled the request as shown in New Relic Browser.","asn":"Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.","asnLatitude":"The latitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's latitude.","asnLongitude":"The longitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's longitude.","asnOrganization":"The organization that owns the Autonomous System Number. Often an ISP, sometimes a private company or institution.","browserHeight":"The height of the end user's browser window at the time when the PageAction occurred.","browserWidth":"The width of the end user's browser window at the time when the PageAction occurred.","city":"The city in which the PageView event occurred, such as Portland or Seattle.","countryCode":"The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.","currentUrl":"The URL on which the PageAction is occurring. This URL may be different from the Page URL.","deviceType":"The type of device that loaded the page: either mobile, tablet, or desktop.","duration":"The browser response time in seconds. Derived from the Navigation Timing API as loadEventEnd minus navigationStart. Inclusive of other duration measurements.","name":"The name of the invoked web transaction. For example: Controller/customers/show.","pageUrl":"The URL of the page that was loaded for the PageView. For example: http://www.newrelic.com. This URL does not include query parameters.","referrerUrl":"The URL of the page that loaded before the PageAction occurred.","regionCode":"The specific administrative division within a country where the PageView event occurred. In the United States, regions correspond to state codes, such as WA or NY. Outside the United States, a country's regions correspond to numerical codes. Read more.","session":"A unique identifier for a single session. Sessions expire when the user closes the browser. A new identifier will be assigned when the user opens up a new browser window.","timeSinceLoad":"The time (in seconds) elapsed from when the page was requested to when the PageAction was created.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","userAgentName":"The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.","userAgentOS":"The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.","userAgentVersion":"The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request."},"BrowserInteraction":{"actionText":"The text of the HTML element that was clicked when a browser interaction started.","ajaxCount":"A count of all XHRs included in the timing of a SPA interaction.","appId":"The ID of your application, as recorded by New Relic.","appName":"The name of the application that handled the request as shown in New Relic Browser.","asn":"Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.","asnLatitude":"The latitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's latitude.","asnLongitude":"The longitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's longitude.","asnOrganization":"The organization that owns the Autonomous System Number. Often an ISP, sometimes a private company or institution.","backendTransactionName":"The name of the backend transaction that served the initial page load.","browserInteractionId":"A unique value generated for each Browser interaction captured by the New Relic agent.","browserInteractionName":"The name of the interaction. This is either the targetGroupedUrl or the custom name set via the API.","category":"The type of interaction; either initial page load, route change, or custom.","city":"The city in which the PageView event occurred, such as Portland or Seattle.","countryCode":"The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.","deviceType":"The type of device that loaded the page: mobile, tablet, or desktop.","domain":"The domain portion of the request URL.","duration":"The total duration, in seconds, of the interaction event","eventId":"A value that you can link to multiple BrowserInteraction events so you can view the interactions that occurred surrounding a specific event. For example, you can see the browser interactions that occurred prior to a JS error.","firstContentfulPaint":"firstContentfulPaint is the point when the browser renders the first bit of content from the DOM, which may be text, an image, SVG, or a <canvas> element. Read more.","firstPaint":"firstPaint marks the point when the browser renders anything that is visually different from what was on the screen prior to navigation. This includes non-default background paint and the enclosing box of an iframe. Read more.","jsDuration":"The total duration, in seconds, spent on JavaScript execution. (This attribute doesn't exist for initial page load events.)","monitorAccountId":"The Synthetics account from which you are running the monitor.","monitorId":"A unique number identifying a particular monitor.","monitorJobId":"The ID of a single Synthetics monitor run, which began at a specific time and originated from a specific location.","parentEventId":"A unique value generated for each interaction with the page. You can use this value to group interactions together.","previousGroupedUrl":"The grouped version of the URL in the browser at the start of the interaction.","previousRouteName":"The route name of the page at the start of the interaction. This is the last value passed by setCurrentRouteName before the start of the interaction.","previousURL":"The ungrouped URL in the browser at the start of the interaction.","regionCode":"The specific administrative division within a country where the PageView event occurred. In the United States, regions correspond to state codes, such as WA or NY. Outside the United States, a country's regions correspond to numerical codes. Read more.","session":"A unique identifier for a single session. Sessions expire when the user closes the browser. A new identifier will be assigned when the user opens up a new browser window.","targetGroupedUrl":"The grouped version of the URL in the browser at the end of the interaction.","targetRouteName":"The route name for the page at the end of the interaction. The last value passed by setCurrentRouteName before the end of the interaction.","targetUrl":"The ungrouped URL in the browser at the end of the interaction.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","timeToConnectEnd":"The time, in seconds, from the start of the interaction to the connectEnd, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToConnectStart":"The time, in seconds, from the start of the interaction to the connectStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomainLookupEnd":"The time, in seconds, from the start of the interaction to the domainLookupEnd, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomainLookupStart":"The time, in seconds, from the start of the interaction to the domainLookupStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomComplete":"The time, in seconds, from the start of the interaction to the domComplete, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomContentLoadedEventEnd":"The time, in seconds, from the start of the interaction to the domContentLoadedEventEnd, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomContentLoadedEventStart":"The time, in seconds, from the start of the interaction to the domContentLoadedEventStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomInteractive":"The time, in seconds, from the start of the interaction to the domInteractive, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToDomLoading":"The time, in seconds, from the start of the interaction to the domLoading, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToFetchStart":"The time, in seconds, from the start of the interaction to the fetchStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToLoadEventEnd":"The time, in seconds, from the start of the interaction to the loadEventEnd, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToLoadEventStart":"The time, in seconds, from the start of the interaction to the loadEventStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToRedirectEnd":"The time, in seconds, from the start of the interaction to the redirectEnd, as defined by the Navigation Timing API. This attribute exists only for initial page load events, not route changes.","timeToRedirectStart":"The time, in seconds, from the start of the interaction to the redirectStart, as defined by the Navigation Timing API. This attribute exists only for initial page load events, not route changes.","timeToRequestStart":"The time, in seconds, from the start of the interaction to the requestStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToResponseEnd":"The time, in seconds, from the start of the interaction to the responseEnd, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToResponseStart":"The time, in seconds, from the start of the interaction to the responseStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToSecureConnectionStart":"The time, in seconds, from the start of the interaction to the secureConnectionStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToUnloadEventEnd":"The time, in seconds, from the start of the interaction to the unloadEventEnd, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToUnloadEventStart":"The time, in seconds, from the start of the interaction to the unloadEventStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","trigger":"The cause of the route change or page load. The default values are click, submit, popstate, or initial page load. For a custom event created with the API, the default value for trigger will be api. This value can also be set via the API.","userAgentName":"The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.","userAgentOS":"The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.","userAgentVersion":"The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request."},"PageView":{"appId":"The ID of your application, as recorded by New Relic.","appName":"The name of the application that handled the request as shown in New Relic Browser.","asn":"Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.","asnLatitude":"The latitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's latitude.","asnLongitude":"The longitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's longitude.","asnOrganization":"The organization that owns the Autonomous System Number. Often an ISP, sometimes a private company or institution.","backendDuration":"The back-end response time in seconds.  Read more.","browserTransactionName":"The transaction name (page view group) as it appears in New Relic Browser.","city":"The city in which the PageView event occurred, such as Portland or Seattle.","connectionSetupDuration":"The time to establish a connection with the server in seconds (inclusive of secureHandshakeDuration). Derived from the Navigation Timing API as connectEnd minus connectStart.","countryCode":"The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.","deviceType":"The type of device that loaded the page: mobile, tablet, or desktop.","dnsLookupDuration":"The time to resolve the DNS record for the top-level resource (in seconds). Derived from the Navigation Timing API as domainLookupEnd minus domainLookupStart.","domain":"The domain portion of the request URL.","domProcessingDuration":"The time it takes to parse the HTML into a DOM and retrieve or execute synchronous scripts.  Read more.","duration":"The browser response time in seconds. Derived from the Navigation Timing API as loadEventEnd minus navigationStart. Inclusive of other duration measurements.","firstContentfulPaint":"firstContentfulPaint is the point when the browser renders the first bit of content from the DOM, which may be text, an image, SVG, or a <canvas> element. Read more.","firstPaint":"firstPaint marks the point when the browser renders anything that is visually different from what was on the screen prior to navigation. This includes non-default background paint and the enclosing box of an iframe. Read more.","name":"The name of the invoked web transaction. For example: Controller/customers/show.","networkDuration":"The total time spent in redirects as well as in requesting and receiving HTML (in seconds). If webAppDuration (server side timing information) is not available, time on the server will be included in this duration.","pageRenderingDuration":"The page rendering phase is the time between DOM completion (domContentLoadedEventEnd) and the window load event (loadEventEnd), in seconds. This phase measures browser-side processing and display of the page content.","pageUrl":"The URL of the page that was loaded for the PageView. For example: http://www.newrelic.com. This URL does not include query parameters.","queueDuration":"The total time the request waits for a service to initiate (in seconds).","regionCode":"The specific administrative division within a country where the PageView event occurred. In the United States, regions correspond to state codes, such as WA or NY. Outside the United States, a country's regions correspond to numerical codes. Read more.","secureHandshakeDuration":"A subset of connectionSetupDuration, the time to establish a TLS connection with the server. Derived from the Navigation Timing API as connectEnd minus secureConnectionStart (in seconds).","session":"A unique identifier for a single session. Sessions expire when the user closes the browser. A new identifier will be assigned when the user opens up a new browser window.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","userAgentName":"The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.","userAgentOS":"The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.","userAgentVersion":"The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request.","webAppDuration":"The total server-side response time for the top-level resource of the PageView (in seconds) as measured by the APM agent.  Read more."},"AjaxRequest":{"appId":"The ID of your application, as recorded by New Relic.","appName":"The name of the application that handled the request as shown in New Relic Browser.","asn":"Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.","asnLatitude":"The latitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's latitude.","asnLongitude":"The longitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's longitude.","asnOrganization":"The organization that owns the Autonomous System Number. Often an ISP, sometimes a private company or institution.","browserInteractionId":"A unique value generated for each Browser interaction captured by the New Relic agent.","browserInteractionName":"The name of the interaction. This is either the targetGroupedUrl or the custom name set via the API.","city":"The city in which the PageView event occurred, such as Portland or Seattle.","countryCode":"The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.","deviceType":"The type of device that loaded the page: mobile, tablet, or desktop.","eventId":"A value that you can link to multiple BrowserInteraction events so you can view the interactions that occurred surrounding a specific event. For example, you can see the browser interactions that occurred prior to a JS error.","groupedPageURL":"The grouped URL of the view that made the AJAX request. For example: myapp.com/acct/*/dash.","groupedRequestUrl":"The grouped URL of the AJAX request. For example: myapp.com/acct/*/ajax.","hostname":"The fully qualified domain name (FQDN) of the request URL.","httpMethod":"The HTTP method of the AJAX request. Example: POST.","httpResponseCode":"The HTTP response code. Example: 200.","jsDuration":"The total duration, in seconds, spent on JavaScript execution. (This attribute doesn't exist for initial page load events.)","pageUrl":"The URL of the page that was loaded for the PageView. For example: http://www.newrelic.com. This URL does not include query parameters.","parentEventId":"A unique value generated for each interaction with the page. You can use this value to group interactions together.","port":"The request port.","priority":"Likelihood this event will be saved.","regionCode":"The specific administrative division within a country where the PageView event occurred. In the United States, regions correspond to state codes, such as WA or NY. Outside the United States, a country's regions correspond to numerical codes. Read more.","requestBodySize":"The payload size of the request body, in bytes.","requestUrl":"The URL of the AJAX request. For example: myapp.com/acct/1/ajax.","responseBodySize":"The payload size of the response body, in bytes.","session":"A unique identifier for a single session. Sessions expire when the user closes the browser. A new identifier will be assigned when the user opens up a new browser window.","timeSinceBrowserInteractionStart":"The time in seconds between the start of the BrowserInteraction and the start of the request.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","timeToLastCallbackEnd":"The duration, in seconds, from the start of the request (timestamp) to the end of the last callback. This is not just an additive function; the callback time can overlap with the wait time.","timeToLoadEventStart":"The time, in seconds, from the start of the interaction to the loadEventStart, as defined by the Navigation Timing API. This attribute exists for initial page load events, not route changes.","timeToSettle":"The time, in seconds, from the start of the request to when all resulting callbacks (including callbacks of subsequent AJAX requests) are complete.","userAgentName":"The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.","userAgentOS":"The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.","userAgentVersion":"The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request."},"BrowserTiming":{"appId":"The ID of your application, as recorded by New Relic.","appName":"The name of the application that handled the request as shown in New Relic Browser.","asn":"Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.","asnLatitude":"The latitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's latitude.","asnLongitude":"The longitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's longitude.","asnOrganization":"The organization that owns the Autonomous System Number. Often an ISP, sometimes a private company or institution.","browserInteractionId":"A unique value generated for each Browser interaction captured by the New Relic agent.","browserInteractionName":"The name of the interaction. This is either the targetGroupedUrl or the custom name set via the API.","browserTimingName":"The name of the event. This is taken from the name argument of createTracer.","city":"The city in which the PageView event occurred, such as Portland or Seattle.","countryCode":"The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.","deviceType":"The type of device that loaded the page: mobile, tablet, or desktop.","eventId":"A value that you can link to multiple BrowserInteraction events so you can view the interactions that occurred surrounding a specific event. For example, you can see the browser interactions that occurred prior to a JS error.","groupedPageURL":"The grouped URL of the view that made the AJAX request. For example: myapp.com/acct/*/dash.","jsDuration":"The total duration, in seconds, spent on JavaScript execution. (This attribute doesn't exist for initial page load events.)","pageUrl":"The URL of the page that was loaded for the PageView. For example: http://www.newrelic.com. This URL does not include query parameters.","parentEventId":"A unique value generated for each interaction with the page. You can use this value to group interactions together.","regionCode":"The specific administrative division within a country where the PageView event occurred. In the United States, regions correspond to state codes, such as WA or NY. Outside the United States, a country's regions correspond to numerical codes. Read more.","session":"A unique identifier for a single session. Sessions expire when the user closes the browser. A new identifier will be assigned when the user opens up a new browser window.","timeSinceBrowserInteractionStart":"The time in seconds between the start of the BrowserInteraction and the start of the request.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","timeToLastCallbackEnd":"The duration, in seconds, from the start of the request (timestamp) to the end of the last callback. This is not just an additive function; the callback time can overlap with the wait time.","timeToSettle":"The time, in seconds, from the start of the request to when all resulting callbacks (including callbacks of subsequent AJAX requests) are complete.","timeToTracedCallbackStart":"The time in seconds from the start of the custom tracer until the start of the traced callback. This attribute is unique to the BrowserTiming event.","tracedCallbackDuration":"The duration in seconds of the traced callback. This attribute is unique to the BrowserTiming event.","userAgentName":"The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.","userAgentOS":"The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.","userAgentVersion":"The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request."},"JavaScriptError":{"appId":"The identification number for the reporting browser agent.","appName":"The name of the application that handled the request as shown in New Relic Browser.","browserInteractionId":"A unique value generated for each Browser interaction captured by the New Relic agent.","browserStackHash":"An unique identifier generated for a stack trace. The browserStackHash for a stack trace is different across different browsers. An identical stack trace will generate the same identifier.","deviceType":"The type of device that loaded the page: mobile, tablet, or desktop.","errorClass":"The error type.","errorMessage":"The error message that was delivered.","firstErrorInSession":"A value to indicate whether or not this was the first JS error in the session. Example: true.","parentEventId":"A unique value generated for each interaction with the page. You can use this value to group interactions together.","releaseIds":"The releases in which the app was updated. Example: {\"jQuery\":\"v3.1.1\",\"multiverse\":\"96e9ac7\"}.","requestUri":"The URI of the requested resource.","stackHash":"A unique identifier generated by the Browser agent for a stack trace. The stackHash for a stack trace is the same across different browsers. An identical stack trace will generate the same identifier.","stackTrace":"A collection of the active stack frames when the error occurred.","timestamp":"The time that the error occurred, in Unix time.","transactionName":"The full metric name of the transaction in which the error occurred, or Unknown if the error occurs outside of a transaction.","userAgentName":"The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.","userAgentOS":"The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.","userAgentVersion":"The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request."}},"Infrastructure":{"SystemSample":{"agentName":"The name of the agent (Infrastructure).","agentVersion":"The version of the New Relic Infrastructure agent.","cpuIdlePercent":"The portion of the current CPU utilization capacity that is idle. Read more.","cpuIoWaitPercent":"The portion of the current CPU utilization composed only of I/O wait time usage. Read more.","cpuPercent":"Total CPU utilization as a percentage. This is not an actual recorded value; it is an alias that combines percentage data from cpuSystemPercent, cpuUserPercent, cpuIoWaitPercent and cpuStealPercent. Read more.","cpuStealPercent":"The portion of time when a virtualized CPU is waiting for the hypervisor to make real CPU time available to it.","cpuSystemPercent":"The portion of the current CPU utilization composed only of system time usage. Read more.","cpuUserPercent":"The portion of the current CPU utilization composed only of user time usage. Read more.","diskFreeBytes":"The cumulative disk space that is free across all supported devices. (To find per-device values, use StorageSample events.)","diskFreePercent":"The cumulative disk emptiness percentage.","diskReadsPerSecond":"The number of read I/O operations per second.","diskReadUtilizationPercent":"The portion of disk I/O utilization for read operations.","diskTotalBytes":"The cumulative total disk space on system.","diskUsedBytes":"The cumulative disk space used across all supported devices, in bytes.","diskUsedPercent":"The cumulative disk fullness percentage.","diskUtilizationPercent":"The percent of time spent waiting for read or write disk I/O operations.","diskWritesPerSecond":"The number of write I/O operations per second.","diskWriteUtilizationPercent":"The portion of disk I/O utilization for write operations.","entityID":"New Relic's unique ID number for the entity that is reporting data. This is used by New Relic to distinguish between customers and their entities.","fullHostname":"The fully qualified (DNS) hostname.","hostname":"The short version of the entity's name.","kernelVersion":"The Linux kernel version, in string format.  Read more.","linuxDistribution":"The name of the Linux distribution the server is using. Read more.","loadAverageFifteenMinute":"Over the last fifteen minutes, the average number of system processes, threads, or tasks that are waiting and ready for CPU time.","loadAverageFiveMinute":"Over the last 5 minutes, the average number of system processes, threads, or tasks that are waiting and ready for CPU time.","loadAverageOneMinute":"Over the last minute, the average number of system processes, threads, or tasks that are waiting and ready for CPU time.","memoryFreeBytes":"The portion of free memory available to this server, in bytes.","memoryTotalBytes":"The total amount of memory, in bytes, available to this server.","memoryUsedBytes":"The portion of available memory that is in use on this server, in bytes.","operatingSystem":"The operating system on which the agent is installed.","swapFreeBytes":"The portion of available swap space on this server that is free, in bytes. This is a Linux-only feature.","swapTotalBytes":"The total amount of swap space available to the server, in bytes. This is a Linux-only feature.","swapUsedBytes":"The portion of available swap space on this server that is in use, in bytes. This is a Linux-only feature.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","windowsFamily":"The Windows family indicates whether the OS is a server or desktop targeted system. Read more.","windowsPlatform":"The full product name of the installed version of Windows. Read more.","windowsVersion":"The combined Windows version and build-number string of the OS. Read more."},"ProcessSample":{"agentName":"The name of the agent (Infrastructure).","agentVersion":"The version of the New Relic Infrastructure agent.","commandLine":"The full command line for the current process. This command line will be sanitized by default to strip options and arguments from the command line to prevent accidental leakage of private information.","commandName":"The base name of the command line's path to the process's form.","contained":"Returns true if the process is running inside a container; false if not inside a container.","containerId":"For processes running inside a Docker container, the unique Docker container ID  for this process.","containerImage":"For processes running inside a Docker container, the Docker image ID  for the image this process is based on.","containerImageName":"For processes running inside a Docker container, the Docker image name  for this process.","containerLabel_KEY":"For processes running inside a Docker container, the Docker label  associated with this process.  Read more.","containerName":"For processes running inside a Docker container, the Docker container name  for this process","cpuPercent":"The combined CPU usage (of all types, including system, user, I/O, depending on platform), by CPU core, for this process at a single point in time. For systems with more than one CPU core, this percentage may be greater than 100%.","cpuSystemPercent":"The system-time CPU usage component used by the process.","cpuUserPercent":"The user-time CPU usage component used by the process.","entityID":"New Relic's unique ID number for the entity that is reporting data. This is used by New Relic to distinguish between customers and their entities.","fullHostname":"The fully qualified (DNS) hostname.","hostname":"The short version of the entity's name.","ioReadBytesPerSecond":"The number of bytes read from all storage devices per second.","ioReadCountPerSecond":"The number of disk read operations by the process per second.","ioTotalReadBytes":"Counts bytes that the process caused to be fetched from the storage layer.  Read more.","ioTotalReadCount":"Cumulative number of disk read operations by this process.","ioTotalWriteBytes":"Counts bytes that the process caused to be sent to the storage layer. Read more.","ioTotalWriteCount":"Cumulative number of disk write operations by this process.","ioWriteBytesPerSecond":"The number of bytes written by this process per second.","ioWriteCountPerSecond":"The number of disk write operations by the process per second.","kernelVersion":"The Linux kernel version, in string format.  Read more.","linuxDistribution":"The name of the Linux distribution the server is using. Read more.","memoryResidentSizeBytes":"The total amount of physical memory in use for the process, in bytes.","memoryVirtualSizeBytes":"The total amount of virtual memory reserved for the process, in bytes.","netIoTotalReceivedPackets":"Cumulative number of net packets received by this process.","netIoTotalSentPackets":"Cumulative number of net packets transmitted by this process.","operatingSystem":"The operating system on which the agent is installed.","parentProcessId":"The unique parent identification number (PID) for this process.","processDisplayName":"The display name (friendly name) of the process. Read more.","processId":"The unique process identification number for this process.","state":"The current process status as a platform-specific state name. For example: running or sleeping.","threadCount":"The number of threads active for this process.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","userId":"The user identifier under which the process is running.","userName":"The username of the owner of the process; for example, root or ubuntu.","windowsFamily":"The Windows family indicates whether the OS is a server or desktop targeted system. Read more.","windowsPlatform":"The full product name of the installed version of Windows. Read more.","windowsVersion":"The combined Windows version and build-number string of the OS. Read more."},"StorageSample":{"agentName":"The name of the agent (Infrastructure).","agentVersion":"The version of the New Relic Infrastructure agent.","avgQueueLen":"The average disk queue length derived from (Disk Transfers/sec) * (Disk secs/Transfer). Read more.","avgReadQueueLen":"The average disk read queue length derived from (Disk Reads/sec) * (Disk secs/Read). Read more.","avgWriteQueueLen":"The average disk write queue length derived from (Disk Writes/sec) * (Disk secs/Write) Read more.","currentQueueLen":"Length of the disk queue at the time of sampling. Read more.","device":"The device name.","diskFreeBytes":"The cumulative disk space that is free across all supported devices. (To find per-device values, use StorageSample events.)","diskFreePercent":"The cumulative disk emptiness percentage.","diskTotalBytes":"The cumulative total disk space on system.","diskUsedBytes":"The cumulative disk space used across all supported devices, in bytes.","diskUsedPercent":"The cumulative disk fullness percentage.","entityAndMountPoint":"A unique identifier concatenating the entityId and mountPoint attributes.","entityID":"New Relic's unique ID number for the entity that is reporting data. This is used by New Relic to distinguish between customers and their entities.","filesystemType":"The operating system's specific file system type. For example: xfs or ext4.","fullHostname":"The fully qualified (DNS) hostname.","hostname":"The short version of the entity's name.","inodesFree":"The number of free inodes. Read more.","inodesTotal":"The number of total available inodes. Read more.","inodesUsed":"The number of inodes in use. Read more.","inodesUsedPercent":"The number of inodes in use as a fraction of the total. Read more.","isReadOnly":"If the system is set to be read-only, this value will be true, otherwise false. These values are string literals, not booleans, to allow for faceting functionality in New Relic Insights.","kernelVersion":"The Linux kernel version, in string format.  Read more.","linuxDistribution":"The name of the Linux distribution the server is using. Read more.","mountPoint":"The location of the device in the operating system's file system.","operatingSystem":"The operating system on which the agent is installed.","readBytesPerSecond":"The number of bytes read per second from the device during the last sampling period.","readIoPerSecond":"The average number of read I/O operations per second during the sampling period.","readUtilizationPercent":"The percent of totalUtilizationPercent dedicated to read I/O operations.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","totalUtilizationPercent":"The percent of time spent waiting for read or write disk I/O operations.","windowsFamily":"The Windows family indicates whether the OS is a server or desktop targeted system. Read more.","windowsPlatform":"The full product name of the installed version of Windows. Read more.","windowsVersion":"The combined Windows version and build-number string of the OS. Read more.","writeBytesPerSecond":"The number of bytes per second written to the device during the last sampling period.","writeIoPerSecond":"The average number of write I/O operations per second during the sample period.","writeUtilizationPercent":"The percent of totalUtilizationPercent dedicated to write I/O operations."},"NetworkSample":{"agentName":"The name of the agent (Infrastructure).","agentVersion":"The version of the New Relic Infrastructure agent.","entityID":"New Relic's unique ID number for the entity that is reporting data. This is used by New Relic to distinguish between customers and their entities.","fullHostname":"The fully qualified (DNS) hostname.","hardwareAddress":"The unique hardware address of the interface.","hostname":"The short version of the entity's name.","interfaceName":"The interface name as reported by the operating system.","ipV4Address":"The IP version 4 address.","ipV6Address":"The IP version 6 address.","kernelVersion":"The Linux kernel version, in string format.  Read more.","linuxDistribution":"The name of the Linux distribution the server is using. Read more.","operatingSystem":"The operating system on which the agent is installed.","receiveBytesPerSecond":"The number of bytes per second received during the sampling period.","receiveDroppedPerSecond":"The number of received packets per second dropped during the sampling period.","receiveErrorsPerSecond":"The number of receive errors per second on the interface during the sampling period.","receivePacketsPerSecond":"The number of packets per second (as defined by OS) received during the sampling period.","state":"The state of the entity: either up or down.","timestamp":"The time (date, hour, minute, second) at which the interaction occurred.","transmitBytesPerSecond":"The number of bytes sent per second during the sampling period.","transmitDroppedPerSecond":"The number of dropped send packets per second during the sampling period.","transmitErrorsPerSecond":"The number of send errors per second on the interface during the sampling period.","transmitPacketsPerSecond":"The number of packets per second as defined by OS) sent during this sampling period.","windowsFamily":"The Windows family indicates whether the OS is a server or desktop targeted system. Read more.","windowsPlatform":"The full product name of the installed version of Windows. Read more.","windowsVersion":"The combined Windows version and build-number string of the OS. Read more."},"InfrastructureEvent":{"category":"A New Relic category used to organize events in the UI. For example: automation, notification, and service.","changedPath":"The fully specified name of the item that changed. This is constructed by taking the source and adding one or more additional path elements that uniquely identify the item that changed.","changeType":"A simple classification of the type of change made to the entity: added, modified, or removed.","deltaId":"Delta refers to a recorded change in the system. The deltaId is a number used by New Relic to organize incoming inventory change data.","eventId":"The unique ID of the event, generated by New Relic.","format":"The type of infrastructure event. Each format type includes attributes that may be used to render the event in the UI.","newStatus":"The new agent status: disconnected or connected.","newValue":"If a change is made to the entity, this attribute contains the new value of the inventory that was changed. This will have no value if no change has been made. The value will display approximately 4K bytes of data.","oldValue":"If a change is made to the entity, this attribute contains the old value of the inventory that was changed. This will be blank if no change has been made.","provider":"For integrations that use generic event types (like the DatastoreSample event), the provider value specifies the source of the data (the service, or a sub-category of data from that service).  Read more.","source":"The fully specified origin of this inventory item. This is typically in the form category/plugin, where plugin is the generic word used for the tool that gathered this data.","summary":"A summary of the change that happened. Uses a human-friendly string, such as Agent disconnected.","violationUpdateType":"The type of change to the violation: For example: open or closed."}},"Mobile":{"MobileSession":{"appBuild":"Indicates the technical build number of the binary that crashed. As a developer, you can use this attribute to see exactly which build of your app crashed.","appId":"A unique identifier for a monitored app, based on the app token. For example: 35091.","appName":"The name of the monitored app. For example: My Mobile App - iOS.","appVersion":"The version number of the monitored app. For example: 2.2.9.","appVersionId":"An identifier for the specific version of the app. For example: 1713477.","asn":"Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.","asnOwner":"The telecom owner of the ASN.","carrier":"The mobile network over which the app transferred data, such as wifi, Verizon, or Sprint.","category":"The type of data, either session or interaction.","city":"The city in which the PageView event occurred, such as Portland or Seattle.","countryCode":"The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.","device":"The specific type of the device: iPhone 8, iPad Pro, etc.","deviceGroup":"The category of the device, such as iPhone or Tablet.","deviceManufacturer":"The manufacturer of the device, such as Motorola or HTC.","deviceModel":"The model number of the device, such as XT1039 or SM-G900F.","deviceType":"The specific type of device: iPhone 8, iPad Pro, etc.","deviceUuid":"The specific UUID of the device assigned by New Relic.","install":"Indicates true only if the current session is the first session after app install.","lastInteraction":"The last interaction before a crash event, if one is present, such as App Launch.","memUsageMb":"The total amount of memory, in MB, used by the application. Updated every 60 seconds.","newRelicAgent":"The New Relic agent running on the application. For example: the iOSAgent or the androidAgent.","newRelicVersion":"The version number of the agent running on the application. For example: 4.232.0.","osMajorVersion":"The simplified version number of the app's host operating system, such as iOS 11, as compared to iOS 11.0.4.","osName":"The name of the app's host operating system, for example, iOS or Android.","osVersion":"The exact version number of the app's host operating system, such as iOS 11.0.4, as compared to iOS 11.","platform":"The platform type of the New Relic Mobile agent, such as Android, iOS, or Cordova.","platformVersion":"The version number of the New Relic Mobile agent running on the application. For example: 4.232.0.","regionCode":"The specific region within a country where the monitored app is located. In the United States, regions are states.","sessionDuration":"The length of time for which the user used the application in seconds. If the session crashes, sessionDuration is not captured (although other events and attributes are still recorded).  Read more.","sessionId":"A unique identifier for a single user session. A new sessionId is created each time the app is brought into the foreground.","timeSinceLoad":"The time, in seconds, from the beginning of the mobile session to the time the event occurred.","timestamp":"The UTC epoch time at which an event began.","upgradeFrom":"Indictates previous version number only if this is the first launch after app upgrade.","uuid":"A unique identifier for a specific app on a particular device. Also found in deviceUuid. Resets on reinstallation of the app. For example: B8B0BC30-0235-11E4-9191-0800200C9A66"},"MobileCrash":{"architecture":"The processor architecture of the device. For example: armv7 or arm64.","bundleId":"The unique string used to identify the application.","crashException":"The exception associated with the crash, if one is present. For example: java.lang.NullPointerException.","crashFingerprint":"The New Relic-generated fingerprint used to uniquely identify the crash and other crashes identical to this one.","crashLocationFile":"The file in which the crash occurred.","crashMessage":"The message associated with the crash, if one is present.","diskAvailable":"Space available on the device, in bytes.","interactionHistory":"The client interactions with the application that led to the crash.","isFirstOccurrence":"A boolean value indicating whether or not this was the first occurrence of the crash.","modelNumber":"The model of the device. This is the same as the session-level deviceModel attribute.","networkStatus":"The type of network that the device was on at the time of crash, such as wifi or LTE.","occurrenceId":"The ID for this instance of the crash.","orientation":"The orientation of the device, such as landscape or portrait.","osBuild":"For Android only. The specific build of the Android OS.","parentProcess":"The parent process that launched the crashing process.","parentProcessId":"The parent identification number (PID) of the parent process.","processId":"The PID of the previously running process on the device.","processName":"The name of the previously running process.","processPath":"The path to the binary.","reportedTimestampMs":"The UTC timestamp for when the event was received by New Relic. (This is different from timestamp, which is when the MobileSession event began that crashed.)","sessionCrashed":"A boolean value indicating whether or not that session crashed.","symbolicated":"A boolean value indicating whether or not the crash was properly symbolicated.","timeSinceLastInteraction":"The time, in seconds, since the interaction before a crash event.","userImageUuids":"The array of build UUIDs for applications and libraries."},"MobileRequestError":{"bytesReceived":"Optional: If the application received a response from the requestUrl, the size of that response in bytes.","bytesSent":"Optional: If the application sent a request to the requestUrl, the size of that request in bytes.","connectionType":"The type of connection which the device was using, such as 2G or 3G.","deviceSize":"The display size of the device: Small, normal, large, xlarge.","errorType":"Either HTTPError or NetworkFailure, depending on whether the error is a result of a failed request to a host or a failure on the cellular network.","networkError":"The error message associated with the iOS NSURL Error code. See networkErrorCode for more information.","networkErrorCode":"If the error is a network error, this is the iOS network error code. For Android applications, this is the mapped value.","requestDomain":"The domain that the application attempted to access when the error occurred.","requestMethod":"The REST method (GET, PUT, POST, etc.) that the application attempted when the error occurred.","requestPath":"The path that the application attempted to access when the error occurred.","requestUrl":"The URL that the application attempted to access when the error occurred.","responseBody":"Optional: The response that is sent from the requestDomain for the HTTP error, up to 4096 bytes.","responseTime":"The time between the request and the response in fractional seconds.","statusCode":"If the error is an HTTPError, New Relic will record the statusCode of that error. You can facet on any statusCode or query for codes you're interested in."},"MobileRequest":{"bytesReceived":"Optional: If the application received a response from the requestUrl, the size of that response in bytes.","bytesSent":"Optional: If the application sent a request to the requestUrl, the size of that request in bytes.","connectionType":"The type of connection which the device was using, such as 2G or 3G.","deviceSize":"The display size of the device: Small, normal, large, xlarge.","requestDomain":"The domain that the application attempted to access when the request occurred.","requestMethod":"The REST method (GET, PUT, POST, etc.) that the application attempted when the request occurred.","requestPath":"The path that the application attempted to access when the request occurred.","requestUrl":"The URL that the application attempted to access when the request occurred.","responseTime":"The time between the request and the response in fractional seconds.","statusCode":"If the request is an HTTP request, New Relic will record the statusCode of that request. You can facet on any statusCode or query for codes you're interested in."},"Mobile":{"category":"The type of data, either session or interaction.","interactionDuration":"For interaction category events only. This is the total time for the interaction to render on the device. In addition to render time, this usually includes all external calls associated with the interaction.  Currently, this attribute is measured in seconds for Android devices and in milliseconds for iOS devices.","name":"For interaction category events only. This is the label of the interaction associated with the event. It is by default assigned by New Relic.  For example: ApplicationsListFragment or Display iOS_Example.MasterViewController.","reportedTimestampMs":"For interaction category events only. The UTC based timestamp for when the event was sent to New Relic. This is different from the attribute ‘timestamp’, which is when the event began."},"MobileHandledException":{"exceptionAppBuildUuid":"The build identifier (uuid) of the binary in which the exception was caught.","exceptionCause":"The platform-specific cause of the exception.","exceptionLocation":"New Relic defined location of an exception. Contains a combination of exception file name, class, line number, and method.","exceptionLocationClass":"Comes from the exception: The class that generated the exception.","exceptionLocationFile":"Comes from the exception: The file where the exception was generated.","exceptionLocationLine":"Comes from the exception: The line number where the exception was generated.","exceptionLocationMethod":"Comes from the exception: The method that generated the exception..","exceptionMessage":"Message associated with the exception. For Android, the Throwable message. An exception message comes from the exception. The message can be user-generated or a generic system message such as Null pointer.","exceptionName":"The potentially symbolicated or deobfuscated exception type."}},"Distributed Tracing":{"Span":{"appId":"The unique numeric identifier assigned by New Relic for the service/application where the transaction was created.","appName":"The application name set in the New Relic agent configuration.","category":"The type of span. Values include: generic, datastore, and http (external). The category type dictates UI display options (available charts, for example) and the collection of specific attributes.","component":"For 'datastore' category spans: the database vendor or driver, such as Redis and MySql. For 'external' category spans: the framework used to make the connection. For example: OkHttp and Net::HTTP.","containerId":"The container ID. The New Relic APM agent collects this when running in a containerized context.","db.instance":"The database name. For example, the name of the database for a given JDBC database connection URL in Java. Reported when the category is 'datastore.' Example value: dbc.url=jdbc:mysql://mysql-db.servers.net:3306/accounts.","db.statement":"The database statement in the format most permissive by configuration. Reported when 'category' is 'datastore.' For a span with a 'component' of 'MySql', an example value would be: SELECT * FROM accounts.","duration":"The span's elapsed time in seconds.","duration.ms":"The span's elapsed time in milliseconds.","entityGuid":"The GUID, assigned by New Relic, for the New Relic-monitored entity (host, application, etc.). This value is stored as a Base64 encoded value.","error":"Makes a span as having an error.","error.class":"The full class name for the span's error.","error.message":"The message for the span's error.","guid":"The unique identifier for the segment. This is equivalent to spanID in OpenTracing semantics.","host":"The name of the application host that processed this request, as identified by the reporting agent. Examples: ip-10-1-34-88, ede2fff1efbe, apphost.domain.com.","http.method":"The HTTP method or language method/function used for the call. Reported when the category is http. Examples: GET, POST.","http.url":"External URI for the call. Reported when 'category' is 'http.' It MUST NOT contain user, password, or query parameters. It MUST be set as an agent attribute and not as an intrinsic so that attribute filtering can be applied.","name":"The span name that best represents the operation.","parentId":"The span parent's GUID (may not be present for the root span).","peer.address":"The address of the datastore, including the host name and the port, path, or ID. Reported when 'category' is 'datastore.' Example: mysql-db.servers.net:3306.","peer.hostname":"The hostname of the database. Reported when 'category' is 'datastore.' Example: mysql-db.servers.net.","priority":"A priority ranking that dictates whether the trace will be reported in situations where the sampling reservoir has exceeded capacity. This is a float value set by the first New Relic agent that’s part of the request.","realAgentId":"The ID of the New Relic agent that reported the data.","sampled":"Whether the request route was chosen to be sampled for tracing.","service.name":"The name of the instrumented service that created this span.","span.kind":"For spans that represent entry or exit into the process, this will be 'server' for entry or 'client' for exit. Datastore and external (http) spans will always have the value 'client.'","timestamp":"Unix timestamp in milliseconds indicating when the span started.","traceId":"The unique ID used to identify a single request as it crosses inter- and intra- process boundaries. This ID allows the linking of spans in a distributed trace.","transactionId":"The GUID of the New Relic transaction associated with the span."}},"AWS Lambda":{"AwsLambdaInvocation":{"aws.coldStart":"A boolean indicating if the AWS Lambda invocation is a cold start.","aws.lambda.arn":"The Amazon Resource Name (ARN) of the instrumented Lambda function.","aws.lambda.eventSource.arn":"The Amazon Resource Name (ARN) of the entity that invoked the instrumented Lambda function.","aws.requestId":"AWS identifier of the invocation.","databaseCallCount":"The number of database calls made by this transaction.","databaseDuration":"The database response time in seconds.","duration":"The total invocation time for the transaction, in seconds.","externalCallCount":"The number of external calls made by this transaction.","externalDuration":"The total response time of all externals, in seconds.","httpResponseCode":"The HTTP response code associated with the transaction.","parent.account":"If a distributed tracing payload is received, this is the account identifier for the transaction's upstream caller.","parent.app":"If a distributed tracing payload is received, this is the application identifier. APM agents retrieve this value in the connect response under the key primary_application_id.","parent.transportType":"When a distributed tracing payload is received, the method of transport for the payload. Example values: Unknown, HTTP, HTTPS, Kafka, JMS, IronMQ, AMQP, Queue, or Other.","parent.type":"If a distributed trace payload was received, the parent's data source type. Example values: App, Browser, Mobile.","request.headers.contentLength":"Incoming request size in bytes as read from the Content-Length HTTP request header.","request.headers.contentType":"Incoming request content-type as read from the HTTP request header Content-Type. Example value: application/octet-stream.","request.headers.host":"The name from the HTTP host request header.","request.headers.referer":"The incoming request referer as read from the Referer request header.","request.headers.User-Agent":"The contents of the User-Agent HTTP header.","request.method":"The HTTP request method used. Example values: POST, GET.","requests.header.accept":"The types as read from the HTTP Accept request header.","response.headers.contentLength":"The outgoing response size in bytes as read from the Content-Length response header.","response.headers.contentType":"For an HTTP response, the data type of the returned response. Example values: text/html, application/json.","totalTime":"The sum of all async components' duration, in seconds. An async component is a method or function where there is no instrumented encapsulating method or function.","type":"The New Relic event type. Example values: Transaction, Span."},"AwsLambdaInvocationError":{"aws.coldStart":"A boolean indicating if the AWS Lambda invocation is a cold start.","aws.lambda.arn":"The Amazon Resource Name (ARN) of the instrumented Lambda function.","aws.lambda.eventSource.arn":"The Amazon Resource Name (ARN) of the entity that invoked the instrumented Lambda function.","aws.requestId":"AWS identifier of the invocation.","databaseCallCount":"The number of database calls made by this transaction.","databaseDuration":"The database response time in seconds.","duration":"The total invocation time for the transaction, in seconds.","error.class":"The class name or type for the error. This will be server and platform specific.","error.message":"The error message for the transaction. This will be server and platform specific.","externalCallCount":"The number of external calls made by this transaction.","externalDuration":"The total response time of all externals, in seconds.","httpResponseCode":"The HTTP response code associated with the transaction.","parent.account":"If a distributed tracing payload is received, this is the account identifier for the transaction's upstream caller.","parent.app":"If a distributed tracing payload is received, this is the application identifier. APM agents retrieve this value in the connect response under the key primary_application_id.","parent.transportType":"When a distributed tracing payload is received, the method of transport for the payload. Example values: Unknown, HTTP, HTTPS, Kafka, JMS, IronMQ, AMQP, Queue, or Other.","parent.type":"If a distributed trace payload was received, the parent's data source type. Example values: App, Browser, Mobile.","request.headers.contentLength":"Incoming request size in bytes as read from the Content-Length HTTP request header.","request.headers.contentType":"Incoming request content-type as read from the HTTP request header Content-Type. Example value: application/octet-stream.","request.headers.host":"The name from the HTTP host request header.","request.headers.referer":"The incoming request referer as read from the Referer request header.","request.headers.User-Agent":"The contents of the User-Agent HTTP header.","request.method":"The HTTP request method used. Example values: POST, GET.","requests.header.accept":"The types as read from the HTTP Accept request header.","response.headers.contentLength":"The outgoing response size in bytes as read from the Content-Length response header.","response.headers.contentType":"For an HTTP response, the data type of the returned response. Example values: text/html, application/json.","stackTrace":"The error stack trace. The format will be different depending on the agent language.","transactionName":"Name of the transaction in which the error occurred. Example value: Controller/customers/show. Value may be 'Unknown' if an error occurs outside of a transaction.","type":"The New Relic event type. Example values: Transaction, Span."}},"CloudTrail":{"InfrastructureEvent":{"category":"A New Relic category used to organize events in the UI. For example: automation, notification, and service.","changedPath":"The fully specified name of the item that changed. This is constructed by taking the source and adding one or more additional path elements that uniquely identify the item that changed.","changeType":"A simple classification of the type of change made to the entity: added, modified, or removed.","deltaId":"Delta refers to a recorded change in the system. The deltaId is a number used by New Relic to organize incoming inventory change data.","eventId":"The unique ID of the event, generated by New Relic.","format":"The type of infrastructure event. Each format type includes attributes that may be used to render the event in the UI.","newStatus":"The new agent status: disconnected or connected.","newValue":"If a change is made to the entity, this attribute contains the new value of the inventory that was changed. This will have no value if no change has been made. The value will display approximately 4K bytes of data.","oldValue":"If a change is made to the entity, this attribute contains the old value of the inventory that was changed. This will be blank if no change has been made.","provider":"For integrations that use generic event types (like the DatastoreSample event), the provider value specifies the source of the data (the service, or a sub-category of data from that service).  Read more.","source":"The fully specified origin of this inventory item. This is typically in the form category/plugin, where plugin is the generic word used for the tool that gathered this data.","summary":"A summary of the change that happened. Uses a human-friendly string, such as Agent disconnected.","violationUpdateType":"The type of change to the violation: For example: open or closed."}},"Synthetics":{"SyntheticRequest":{"checkId":"The unique identifier of the check that triggered this request.","contentCategory":"A generalized version of the media type of the content returned by the host; for example, html or javascript. To query the exact media type, use the contentType attribute.","contentType":"The media type [external link] of the content returned by the host; for example, text/html or image/gif.","domain":"The domain portion of the request URL. To retrieve the entire URL, use the URL attribute.","duration":"The total time for this request, in milliseconds.","durationBlocked":"The total time this request was blocked, in milliseconds.","durationConnect":"The total time this request was establishing a connection, in milliseconds. This is inclusive of the timing from durationSSL.","durationDNS":"The total time this request resolving DNS, in milliseconds.","durationReceive":"The total time this request was receiving data, in milliseconds.","durationSend":"The total time this request was sending data, in milliseconds.","durationSSL":"The total time spent establishing an SSL connection, in milliseconds.","durationWait":"The total time this request was waiting, in milliseconds.","externalResource":"Whether the resource returned by the host is from an external domain. Returns TRUE for an external domain.","host":"The hostname of the server that processed the request.","id":"A unique number identifying this monitor check.","isAjax":"Whether the request is an AJAX request, determined by the HTTP_X_REQUESTED_WITH header.","jobId":"Alias for checkId.","location":"The location from which the monitor check ran. For example, AWS_US_EAST_1 identifies a location on the east coast of the United States.","locationLabel":"The request location (user friendly).","monitorName":"The name of the monitor, as shown in the Synthetics interface.","onPageContentLoad":"The total time to completely load and parse the initial HTML document, in milliseconds. This does not include external resources such as stylesheets, images and subframes.","onPageLoad":"The total time to load the page and all dependent resources, in milliseconds.","pageref":"The page request to which the requested resource belongs. Page requests are numbered from page_0 upward.","path":"The path portion of the request URL. To retrieve the entire URL, use the URL attribute.","requestBodySize":"The size of the body request to the host, in bytes.","requestHeaderSize":"The size of the header request to the host, in bytes.","responseBodySize":"The size of the response body from the host, in bytes.","responseCode":"The HTTP response code returned by the host; for example, 200, 400, 503, atc.","responseHeaderSize":"The size of the response header from the host, in bytes.","serverIPAddress":"The IP address of the server that processed the request.","URL":"The full request URL.","verb":"The protocol (such as GET or POST) used to make the request."},"SyntheticsPrivateLocationStatus":{"checksPending":"Count of how many checks are scheduled to run in that location.","name":"The private location name that New Relic sets internally, based  on the accountId, location name, and private location key.","timestamp":"The start time of the job in epoch milliseconds."},"SyntheticCheck":{"duration":"The total time between the beginning of the first HTTP request and the end of the final HTTP request, in milliseconds.","error":"Error message returned during the monitor run, if an error message was received.","id":"A unique number identifying this monitor check.","location":"The location from which the monitor check ran. For example, AWS_US_EAST_1 identifies a location on the east coast of the United States.","locationLabel":"The check location (user friendly).","monitorId":"A unique number identifying a particular monitor.","monitorName":"The name of the monitor, as shown in the Synthetics interface.","result":"Whether the monitor run succeeded.","timestamp":"The start time of the job in epoch milliseconds.","totalRequestBodySize":"The size of the body request to the host, in bytes.","totalRequestHeaderSize":"The size of the header request to the host, in bytes.","totalResponseBodySize":"The size of the response body returned by the host, in bytes.","totalResponseHeaderSize":"The size of the response header returned by the host, in bytes.","type":"The monitor type. Options include: SIMPLE, BROWSER, SCRIPT_BROWSER, API_TEST.  Read more.","typeLabel":"The user-friendly name of the monitor type."},"SyntheticsPrivateMinion":{"minionId":"The unique identifier of this minion.","minionJobsFailed":"The number of jobs this minion has failed.","minionJobsFinished":"The number of jobs this minion has finished.","minionJobsQueued":"The number of jobs this minion is currently working on.","minionJobsReceived":"The number of jobs this minion has received to process.","minionJobsStarted":"The number of jobs this minion has started.","minionJobsTimedout":"The number of jobs that reached the maximum execution time.","minionLocation":"The location code this minion is operating in.","minionStartTimestamp":"The time which this specific minion started."}}}
